
[
  {
    "id": "5",
    "category": "semester1",
    "name": "Design & Programming of digital user interfaces 1",
    "shortName": "UI 1",
    "shortDescription": "",
    "longDescription": "",
    "skills": "<h2>Skills</h2><p>You will gain knowledge about how to create “good” design by making use of layout and composition. </p>",
    "knowledge": "<h2>Knowledge</h2><p>You will have a basic understanding of web design techniques and you will be able to create a simple websites using html5 and CSS3. Moreover, you will be able to plan and conduct user tests of digital media productions.</p>",
     "competance": "<h2>Competences</h2><p>You will be able to draw the connection between identity and design and the connection between message and design.</p>",
    "ECTS": "15 ECTS",
    "exam": ""
  },
    {
    "id": "6",
    "category": "semester1",
    "name": "Design & Programming of digital content 1",
    "shortName": "Content 1",
    "shortDescription": "",
    "longDescription": "",
    "skills": "<h2>Skills</h2><p>You will be able to create basic animations using JavaScript and produce video- and other digital content.</p>",
    "knowledge": "<h2>Knowledge</h2><p>You will acquired a knowledge of basic methods and theories regarding user understanding within digital content production.</p>",
    "competance": "<h2>Competences</h2><p>You will be able to handle interactive communication in multimedia products.</p>",
    "ECTS": "15 ECTS",
    "exam": "<p>Individual oral exam: 30 ECTS</p>"
  },
    {
    "id": "7",
    "category": "semester2",
    "name": "Design & Programming of digital user interfaces 2",
    "shortName": "UI 2",
    "shortDescription": "",
    "longDescription": "",
    "skills": "<h2>Skills</h2><p>You will acquire the skill to present communication strategies for multimedia tasks and you will be able to plan and assess project management in team-based digital media productions. </p>",
    "knowledge": "<h2>Knowledge</h2><p>You will gain key methods for documenting design and you can now put the history of design and aesthetics in relation to the multimedia field.</p>",
    "competance": "<h2>Competences</h2><p>You will have gained competencies needed to identify relevant theories, methods and tools for the creation of complex digital media productions.</p>",
    "ECTS": "15 ECTS",
    "exam": ""
  },
    {
    "id": "8",
    "category": "semester2",
    "name": "Design & Programming of digital content 2",
    "shortName": "Content 2",
    "shortDescription": "",
    "longDescription": "",
    "skills": "<h2>Skills</h2><p>You will be able to design user interfaces for different digital platforms and you will be able to assess and apply key user-oriented design methods.</p>",
    "knowledge": "<h2>Knowledge</h2><p>You will have an understanding of the technologies used to store and exchange data. Moreover, you will have an understanding of the relationship between business models and digital content production. </p>",
    "competance": "<h2>Competences</h2><p>You will be able to manage the design and development of interactive user interfaces.</p>",
    "ECTS": "15 ECTS",
    "exam": "<p>Group oral exam: 30 ECTS</p>"
  },
    {
    "id": "9",
    "category": "semester3",
    "name": "Electives",
    "shortName": "Electives",
    "shortDescription": "",
    "longDescription": "",
    "skills": "<p>The electives are offered as a means for students to specialise themselves in particular subjects related to multimedia design and communication in line with the purpose and objectives of the study programme.</p>",
    "knowledge": "<h2>Electives</h2><p>The students have the opportunity to choose one of the following elective courses.</p><ul><li>Frontend Design (taught in English)</li><li>Persuasive Content (taught in English)</li><li>Digitalt design og indhold (taught in Danish)</li>",
    "competance": "<p>possibility for exchange</p>",
    "ECTS": "30 ECTS",
    "exam": "<p>Elective exam: 30 ECTS</p>"
  },
    {
    "id": "11",
    "category": "semester4",
    "name": "Internship",
    "shortName": "Internship",
    "shortDescription": "",
    "longDescription": "",
    "skills": "<h2>Internship Exam</h2><p>The internship period concludes with a test. This test is evaluated with an internal examiner and is graded according to the 7-point scale.</p>",
    "knowledge": "<h2>Internship</h2><p>During the internship, students are faced with professionally relevant issues, just as they become familiarised with relevant job functions. Students must actively and independently seek a placement with one or more private or public companies.</p>",
    "competance": "",
    "ECTS": "15 ECTS",
    "exam": "<p>15 ECTS</p>"
  },
    {
    "id": "12",
    "category": "semester4",
    "name": "Final Exam Project",
    "shortName": "Final Exam",
    "shortDescription": "",
    "longDescription": "",
    "skills": "",
    "knowledge": "<h2>Final Exam</h2><p>The final exam project must document the student’s understanding of practice and key applied theories and methods in relation to a practice-oriented issue based on a specific assignment within the area of the programme. It needs to have a problem statement, that needs to be approved by the educational institution. The final exam project can be done in cooperation with a public or private company. Alternatively, the final exam project can be based on the student starting up his or her own business. The project concludes with a report and a digital media production. The final exam project must not exceed 30 standard pages for one student + 10 standard pages for each additional group member. Front page, table of contents, bibliography and appendices are not included in the maximum number of pages. Appendices will not be assessed. A standard page is 2,400 characters with spaces and footnotes. </p><p>The exam consists of an oral and a written part with an external co-examiner, where a single aggregate individual grade according to the 7-point grading scale is awarded for the written project and the oral performance.</p>",
    "competance": "",
    "ECTS": "15 ECTS",
    "exam": "<p>15 ECTS</p>"
  }
]
